blog/_posts/2013-11/2013-11-16-ubuntu-jdk.html
---
layout: post
keywords: 
description: 
title: ubuntu12.04安装和配置java JDK 
categories: [java]
tags: [java,jdk]
group: archive
icon: code
featured: false
---

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 下载</a></li>
<li><a href="#sec-2">2 安装</a>
<ul>
<li><a href="#sec-2-1">2.1 Step1:</a></li>
<li><a href="#sec-2-2">2.2 Step2:</a></li>
<li><a href="#sec-2-3">2.3 Step3:</a></li>
<li><a href="#sec-2-4">2.4 Step4:</a></li>
</ul>
</li>
<li><a href="#sec-3">3 参考资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">下载</h2>
<div class="outline-text-2" id="text-1">

<p>先去<a href="http://www.oracle.com/technetwork/java/javase/downloads/jdk7-downloads-1880260.html">Oracle</a> 下载Linux下的JDK压缩包，我下载的是jdk-7u45-linux-x64.tar.gz文件，下好后直接解压
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">安装</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Step1:</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="src src-sh"><span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#23558;&#21387;&#32553;&#21253;&#35299;&#21387;&#21040;/usr/lib/jvm&#30446;&#24405;&#37324;</span>
tar xvzf jdk-7u45-linux-x64.tar.gz -C /usr/lib/jvm/
</pre>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">Step2:</h3>
<div class="outline-text-3" id="text-2-2">




<pre class="src src-sh"><span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">&#37197;&#32622;&#29615;&#22659;&#21464;&#37327;</span>
sudo vim /etc/profile
<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#22312;&#25991;&#20214;&#30340;&#26368;&#21518;&#38754;&#22686;&#21152;&#22914;&#19979;&#22235;&#34892;&#65306;</span>
<span style="color: #cd6600;">export</span> <span style="color: #2e8b57;">JAVA_HOME</span>=/usr/lib/jvm/jdk1.7.0_45
<span style="color: #cd6600;">export</span> <span style="color: #2e8b57;">JRE_HOME</span>=/usr/lib/jvm/jdk1.7.0_45/jre
<span style="color: #cd6600;">export</span> <span style="color: #2e8b57;">PATH</span>=$<span style="color: #2e8b57;">JAVA_HOME</span>/bin:$<span style="color: #2e8b57;">JAVA_HOME</span>/jre/bin:$<span style="color: #2e8b57;">PATH</span>
<span style="color: #cd6600;">export</span> <span style="color: #2e8b57;">CLASSPATH</span>=$<span style="color: #2e8b57;">CLASSPATH</span>:.:$<span style="color: #2e8b57;">JAVA_HOME</span>/lib:$<span style="color: #2e8b57;">JAVA_HOME</span>/jre/lib
</pre>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">Step3:</h3>
<div class="outline-text-3" id="text-2-3">




<pre class="src src-sh"><span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">&#23558;&#31995;&#32479;&#40664;&#35748;&#30340;jdk&#20462;&#25913;&#36807;&#26469;</span>
sudo update-alternatives --install /usr/bin/java java /usr/lib/jvm/jdk1.7.0_45/bin/java 300
sudo update-alternatives --install /usr/bin/javac javac /usr/lib/jvm/jdk1.7.0_45/bin/javac 300
sudo update-alternatives --config java
<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#36755;&#20837;sun jdk&#21069;&#30340;&#25968;&#23383;</span>
sudo update-alternatives --config javac
<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#26174;&#31034;Nothing to configure</span>
</pre>

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4">Step4:</h3>
<div class="outline-text-3" id="text-2-4">

<p>然后再输入java -version,看到如下信息，就说明改成sun的jdk了:
</p>


<pre class="src src-sh">java version <span style="color: #8b7355;">"1.7.0_45"</span>
<span style="color: #cd9b1d;">Java</span>(TM) SE Runtime Environment (build 1.7.0_45-b18)
Java HotSpot(TM) 64-Bit Server VM (build 24.45-b08, mixed mode)
</pre>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">参考资料</h2>
<div class="outline-text-2" id="text-3">

<p><a href="http://img.snail8.com/?p=461">http://img.snail8.com/?p=461</a>
</p>
<p>
<a href="http://ivan-site.com/2012/05/download-oracle-java-jre-jdk-using-a-script/">http://ivan-site.com/2012/05/download-oracle-java-jre-jdk-using-a-script/</a>
</p></div>
</div>
